TAMUChineseSchool_final_final/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
SELECT "users".* FROM "users"
---
  def index

    @courses = Course.all
    @teachers=User.all

SELECT "courses".* FROM "courses"
---
  def show
    @courses = Course.all

SELECT "users".* FROM "users"
---
  def new
    @teachers=User.select{|a| a.teacher?}

INSERT INTO "courses" ("class_room", "course_discription", "created_at", "end_time", "name", "semester", "start_time", "textbook", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)
    authorize @course
    @course.save

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
---
  def destroy
    @course = Course.find(params[:id])
    authorize @course
    @course.destroy