TAMUChineseSchool_final_final/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def new
    @courses=Course.all