TAMUChineseSchool_final_final/app/views/courses/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
        <td><%= course.textbook %></td>
        <td><%= @teachers.find(course.user_id).name %></td>