TAMUChineseSchool_final_final/app/views/courses/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
              <td><%= course.textbook %></td>
              <td><%= @teachers.find(course.user_id).name %></td>