TAMUChineseSchool_new/app/views/teachers/new.html.erb

        <td><%= f.label :User %></td>
        <td><%= f.select :User, @users.collect { |a| a.firstName+a.last_name } %></td>
---
SELECT "users".* FROM "users"