TAMUChineseSchool_new/app/controllers/courses_controller.rb

SELECT "teachers".* FROM "teachers"
---
  def new
    @courses=Course.all
    @teachers=Teacher.all