TAMUChineseSchool_new/app/controllers/teachers_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @users=User.all

INSERT INTO "teachers" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2014-12-11 12:09:31.660351"], ["updated_at", "2014-12-11 12:09:31.660351"], ["user_id", 1]]
---
  def create
    @teacher = Teacher.new(user_id: params[:teacher][:user_id])

    @teacher.save