TAMUChineseSchool_new/app/controllers/users_controller.rb

INSERT INTO "users" ("address", "created_at", "email", "first_name", "first_name_chn", "gender", "last_name", "last_name_chn", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    @user.save