TAMUChineseSchool_new/app/views/courses/new.html.erb

        <td><%= f.label :Teacher %></td>
        <td><%= f.select :Teacher, @teachers.collect { |a| a.fullname} %></td>
---
SELECT "teachers".* FROM "teachers"