TAMUChineseSchool_final_final/app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "users"
---
</div>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>